ch5/ch5-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-12 Wed 08:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 5.2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 5.2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc90cdb9">ch5.2</a>
<ul>
<li><a href="#org561bdbc">5.2-1</a></li>
<li><a href="#org2791700">5.2-2</a></li>
<li><a href="#orgb99d700">5.2-3</a></li>
<li><a href="#org922e7fa">5.2-4</a></li>
<li><a href="#org4254848">5.2-5</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc90cdb9" class="outline-2">
<h2 id="orgc90cdb9">ch5.2</h2>
<div class="outline-text-2" id="text-orgc90cdb9">
</div>
<div id="outline-container-org561bdbc" class="outline-3">
<h3 id="org561bdbc">5.2-1</h3>
<div class="outline-text-3" id="text-org561bdbc">
<p>
<b>Hire exact one time:</b> The best candidate appears first,
the probability is \(\frac{1}{n}\).
</p>

<p>
<b>Hire n times:</b> The candidates appears in decrease order,
the probability is \(\frac{1}{n!}\).
</p>
</div>
</div>
<div id="outline-container-org2791700" class="outline-3">
<h3 id="org2791700">5.2-2</h3>
<div class="outline-text-3" id="text-org2791700">
<p>
We know that the first candidate and the best candidate will
always been hired, let the first candidate to be \(A[1]\), and the
best candidate to be \(A[k]\), there should be \(A[1] = best(A[1..k-1])\)
to hire exactly two candidates, i.e., choose the best of \(k-1\) candidates,
the total probability is \(\frac{1}{n}\sum_{k=2}^{n-1}\frac{1}{k-1}\).
</p>
</div>
</div>
<div id="outline-container-orgb99d700" class="outline-3">
<h3 id="orgb99d700">5.2-3</h3>
<div class="outline-text-3" id="text-orgb99d700">
<p>
The expected value of k-th dice is
</p>
\begin{align*}
E[X_k]
&=\sum_{x=1}^{6}x\Pr\{X_k=x\}\\
&=\sum_{x=1}^{6}\frac{x}{6}\\
&=\frac{7}{2}
\end{align*}
<p>
The expected value of the sum of n dice is
</p>
\begin{align*}
E[X]
&=E\Bigg[\sum_{i=1}^{n}X_i\Bigg]\\
&=\sum_{i=1}^{n}E[X_i]\\
&=\sum_{i=1}^{n}\frac{7}{2}\\
&=\frac{7n}{2}
\end{align*}
</div>
</div>
<div id="outline-container-org922e7fa" class="outline-3">
<h3 id="org922e7fa">5.2-4</h3>
<div class="outline-text-3" id="text-org922e7fa">
<p>
Each customer has \(\frac{1}{n}\) probability to get back their own hat,
the expected value is \(E[X_k] = \frac{1}{n}\).
</p>

<p>
The total expected number of customers who get back their own hat is
\(E[X] = \sum_{i=1}^{n}E[X_i] = 1\).
</p>
</div>
</div>
<div id="outline-container-org4254848" class="outline-3">
<h3 id="org4254848">5.2-5</h3>
<div class="outline-text-3" id="text-org4254848">
<p>
The probability that a pair is an inversion is exactly \(\frac{1}{2}\),
the expected value is \(E[X_{ij}] = \frac{1}{2}\).
</p>

<p>
The total expected number of inversions is
</p>
\begin{align*}
E[X]
&=\sum_{i=1}^{n-1}\sum_{j=i}^{n}E[X_{ij}]\\
&=\frac{n(n-1)}{4}
\end{align*}
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2022-10-12 Wed 08:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
